// ให้แสดงผลลัพธ์ดังนี้
// ===============
// รอบที่ 1 
// รอบที่ 2 
// รอบที่ 3 
// รอบที่ 4 
// รอบที่ 5 


package W11;

public class W11_01_exLoopFor {
    public static void main(String[] args) {
        
         //System.out.println("Loop 1");
         //System.out.println("Loop 2");
         //System.out.println("Loop 3");
         //System.out.println("Loop 4");
         //System.out.println("Loop 5");
for(int i = 1 ; i <= 8  ; i++){
    //คำสั่งต้องการให้ทำสั่งลูป 5 รอบ
        System.out.println("Hello World "+i);
}
// โครงสร้างคำสั่งลูป for แบ่งออกเป็น 3 ส่วน
// 1. ส่วนตัวแปรเริ่มต้น
// 2. เงื่อนไข
// 3. การเพิ่มค่า / การลดค่า

for (int i = 1 ; i <= 3 ; i++){
    System.out.println("Loop "+i);
}


// ======================================================================

//คำสั่ง 1 ให้แสดงผลลัพธ์ดังนี้
// ===============
// รอบที่ 1 Hello World
// รอบที่ 2 Hello World
// รอบที่ 3 Hello World
// รอบที่ 4 Hello World
// รอบที่ 5 Hello World

for (int i=1;i<6;i++){
    System.out.println("Hello World "+i);
}


// ======================================================================

//คำสั่ง 2 ให้แสดงผลลัพธ์ดังนี้
// ===============
// 1 2 3 4 5 6 7 8 9 10

for (int j = 1; j <= 10 ; j++) {
    System.out.print(j + " ");
}


// ======================================================================


//คำสั่ง 2.1 ให้แสดงผลลัพธ์ดังนี้
// ===============
// 1 2 3 4 5 6 7 8 9 10 = 55
System.out.println(" ");
int sum = 0;
for (int j = 1 ; j <= 10 ; j++) {
 System.out.print( + j + " ");
 sum = sum + j; //sum += j; ความหมายเดียวกันจ้า
}
System.out.println("= " + sum);
// ======================================================================

//คำสั่ง 2.2 ให้แสดงผลลัพธ์ดังนี้
// ===============
// 1+2+3+4+5+6+7+8+9+10 = 55
System.out.println(" ");
int sum1 = 0;
for (int j = 1 ; j <= 10 ; j++) {
    System.out.print(+j+"");
    sum1 = sum1 + j; //sum += j; ความหมายเดียวกันจ้า
    if (j <= 9) {
        System.out.print("+");
    }
} System.out.println(" = " + sum1);

// ======================================================================


//คำสั่ง 3 ให้แสดงผลลัพธ์ดังนี้
// ===============
// 10 9 8 7 6 5 4 3 2 1

//
for( int i = 10 ; i >= 1; i--){ 
    System.out.print(i+" ");
}

// ======================================================================

//คำสั่ง 4 ให้แสดงผลลัพธ์ดังนี้
// ===============
// 1 3 5 7 9 11 13 15 17 19
System.out.println(" ");
for (int i = 1 ; i < 20 ;i+=2) {
    System.out.print(" "+i);
}


// ======================================================================

//คำสั่ง 5 ให้แสดงผลลัพธ์ดังนี้
// ===============
// 2 4 6 8 10 12 14 16 18 20
System.out.println(" ");
for (int i=2 ; i<=20 ; i+=2 ){
    System.out.print(" "+i);
}

// ======================================================================

//คำสั่ง 6 ให้แสดงผลลัพธ์ดังนี้
// ===============
// 1 4 9 16 25 36 49 64 81 100
System.out.println(" ");
 for (int i=1 ; i<=10 ; i++ ){
     System.out.print(i*i+" ");

 }

// ======================================================================

//คำสั่ง 7 ให้แสดงผลลัพธ์ดังนี้
// ===============
// รอบที่ 1 เลขคี่
// รอบที่ 2 เลขคู่
// รอบที่ 3 เลขคี่
// รอบที่ 4 เลขคู่
// รอบที่ 5 เลขคี่
System.out.println(" ");
for (int i = 1 ; i<=5 ; i++ ){
    if (i%2==0){
        System.out.println("Loop "+i+" Odd numbers");
    }else{
        System.out.println("Loop "+i+"Even numbers");
    }
}


// ======================================================================

    }
}